### Filling missing values

In [5]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [6]:
data = pd.read_excel('./fill_na.xlsx')

In [7]:
data

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

### Filling all missing values with a common value

In [8]:
data.fillna(12)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      12.0000  12.000000      12
2 2020-05-08      30.9343  12.000000   rainy
3 2020-05-09      12.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  12.000000   sunny

#### adding missing values to individual columns

In [10]:
data.fillna({'temperature':20,'windSpeed':10,'status':'rainy'})

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      20.0000  10.000000   rainy
2 2020-05-08      30.9343  10.000000   rainy
3 2020-05-09      20.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  10.000000   sunny

#### Filling missing values by accessing individual colunms

In [11]:
data.temperature.fillna(21)

0    35.6582
1    21.0000
2    30.9343
3    21.0000
4    13.9082
5    23.9382
Name: temperature, dtype: float64

In [12]:
data.windSpeed.fillna(12)

0    10.788378
1    12.000000
2    12.000000
3     6.889682
4    19.012990
5    12.000000
Name: windSpeed, dtype: float64

In [13]:
data.status.fillna('sunny')

0     sunny
1     sunny
2     rainy
3    cloudy
4     rainy
5     sunny
Name: status, dtype: object

#### Forward fill(row)

In [14]:
data.fillna(method="ffill")

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343  10.788378   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

#### Backward fill(row)

In [15]:
data.fillna(method="bfill")

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343   6.889682   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

#### Forward fill(column)

In [17]:
data.fillna(method="ffill",axis="columns")

        date          temperature            windSpeed               status
0 2020-05-06              35.6582            10.788378                sunny
1 2020-05-07  2020-05-07 00:00:00  2020-05-07 00:00:00  2020-05-07 00:00:00
2 2020-05-08              30.9343              30.9343                rainy
3 2020-05-09  2020-05-09 00:00:00             6.889682               cloudy
4 2020-05-10              13.9082             19.01299                rainy
5 2020-05-11              23.9382              23.9382                sunny

#### Backward fill(column)

In [18]:
data.fillna(method="bfill",axis="columns")

        date temperature  windSpeed  status
0 2020-05-06     35.6582  10.788378   sunny
1 2020-05-07         NaT        NaT     NaT
2 2020-05-08     30.9343      rainy   rainy
3 2020-05-09    6.889682   6.889682  cloudy
4 2020-05-10     13.9082   19.01299   rainy
5 2020-05-11     23.9382      sunny   sunny

#### Limiting forward fill/backward fill

In [19]:
data.fillna(method="ffill",limit=2)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343  10.788378   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

In [20]:
data.fillna(method="ffill",limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

In [27]:
data.fillna(method="bfill",limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343        NaN   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

#### Filling with pandas object

In [28]:
data.fillna(data.mean())

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

In [31]:
data.fillna(data.mode())

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      23.9382  10.788378   sunny
2 2020-05-08      30.9343  19.012990   rainy
3 2020-05-09      35.6582   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

### Filling for specific range of columns

In [33]:
data.fillna(data.mean()['temperature':'windspeed'])

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

#### Interpolate missing values

#### Linear interpolate

In [34]:
data.temperature.interpolate()

0    35.65820
1    33.29625
2    30.93430
3    22.42125
4    13.90820
5    23.93820
Name: temperature, dtype: float64

#### Other methods

In [36]:
data.temperature.interpolate(method="barycentric")

0    35.65820
1    39.46530
2    30.93430
3    19.32775
4    13.90820
5    23.93820
Name: temperature, dtype: float64

In [37]:
data.windSpeed.interpolate(method="pchip")

0    10.788378
1     8.044851
2     7.034078
3     6.889682
4    19.012990
5    20.312555
Name: windSpeed, dtype: float64

In [38]:
data.windSpeed.interpolate(method="akima")

0    10.788378
1     5.014522
2     3.714956
3     6.889682
4    19.012990
5          NaN
Name: windSpeed, dtype: float64

In [39]:
data.temperature.interpolate(method="spline",order=2)

0    35.658200
1    35.076089
2    30.934300
3    20.526966
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [40]:
data.temperature.interpolate(method="polynomial",order=2)

0    35.658200
1    36.196165
2    30.934300
3    19.872606
4    13.908200
5    23.938200
Name: temperature, dtype: float64